Repository: 84000/data-translation-memory
Catalog: toh74-v3.tmx
Source language: bo
Languages: en

source: འཕགས་པ་བུ་མོ་བློ་གྲོས་བཟང་མོས་ཞུས་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ། སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ། །
en: The Noble Mahāyāna Sūtra The Inquiry of the Girl Sumati Homage to all buddhas and bodhisattvas!

source: འདི་སྐད་བདག་གིས་ཐོས་པ་དུས་གཅིག་ན།
en: Thus did I hear at one time.

source: བཅོམ་ལྡན་འདས་རྒྱལ་པོའི་ཁབ་ན་བྱ་རྒོད་ཀྱི་ཕུང་པོའི་རི་ལ་དགེ་སློང་སྟོང་ཉིས་བརྒྱ་ལྔ་བཅུའི་དགེ་སློང་གི་དགེ་འདུན་ཆེན་པོ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཁྲིའི་བྱང་ཆུབ་སེམས་དཔའི་དགེ་འདུན་ཆེན་པོ་དང་ཐབས་ཅིག་ཏུ་བཞུགས་སོ། །
en: The Bhagavān was residing on Vulture Peak at Rājagṛha together with a large community of twelve hundred and fifty monks and a large community of ten thousand bodhisattvas.

source: དེའི་ཚེ་རྒྱལ་པོའི་ཁབ་ཀྱི་གྲོང་ཁྱེར་ཆེན་པོ་ན་ཁྱིམ་བདག་དྲག་ཤུལ་ཅན་གྱི་བུ་མོ་བློ་གྲོས་བཟང་མོ་ཞེས་བྱ་བ་བཙས་ནས་ལོ་བརྒྱད་ལོན་པ་འདྲ་བ།
en: At that time, in the great city of Rājagṛha, there lived a girl named Sumati who was the daughter of the householder Ugra.

source: གཟུགས་བཟང་བ། མཛེས་པ། བལྟ་ན་སྡུག་པ། ཁ་དོག་བཟང་པོ་རྒྱས་པ་མཆོག་དང་ལྡན་པ།
en: She was about eight years old, had a graceful appearance, was beautiful and pleasant to behold, had a fine complexion, and was well proportioned.

source: སྔོན་གྱི་རྒྱལ་བ་ལ་ལྷག་པར་བྱ་བ་བྱས་པ། དགེ་བའི་རྩ་བ་བསྐྱེད་པ།
en: In the past, she had served the victors and generated roots of virtue.

source: སངས་རྒྱས་འབུམ་ཕྲག་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་མང་པོ་ལ་བསྙེན་བཀུར་བྱས་པ། སངས་རྒྱས་འབུམ་ཕྲག་བྱེ་བ་ཁྲག་ཁྲིག་དཔག་ཏུ་མེད་པ་ལ་དགེ་བའི་རྩ་བ་བསྐྱེད་པ་ཞིག་འདུག་པ་དེ་འཁོར་དང་བཅས་པ་བྱ་རྒོད་ཀྱི་ཕུང་པོའི་རི་ག་ལ་བ་དང་།
en: She had venerated many hundreds and thousands of millions and billions of buddhas and accumulated roots of virtue in the company of countless millions upon billions upon trillions of buddhas.

source: བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ།
en: Together with her retinue, she went to Vulture Peak where the Bhagavān was residing and bowed down with her head at his feet.

source: བཅོམ་ལྡན་འདས་ལ་ལན་གསུམ་བསྐོར་བ་བྱས་ནས་བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་འདུག་སྟེ་བཅོམ་ལྡན་འདས་ལ་ཚིགས་སུ་བཅད་དེ་གསོལ་པ། གལ་ཏེ་སྐབས་ཕྱེ་བདག་གིས་ནི། །རྫོགས་པའི་སངས་རྒྱས་རྐང་གཉིས་མཆོག །འཇིག་རྟེན་སྣང་བར་མཛད་པ་ལ། །བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་གང་ཞུ། །
en: Then, after walking around the Bhagavān three times, keeping him on her right, she sat down in front of him and addressed him in verse: “If I may, I would like to ask the perfect Buddha, The best of those who walk on two feet, The one who illuminates the world: What are the practices of a bodhisattva?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། །ཡིད་ལ་ཅི་འདོད་ཐམས་ཅད་ནི། །བུ་མོ་ཁྱོད་ཀྱིས་དྲི་བར་གྱིས། །བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཀུན། །ཅི་འདྲ་ཁྱོད་ལ་བསྟན་པར་བྱ། །
en: The Bhagavān replied: “Girl, ask whatever you like, And I will explain to you All the practices of a bodhisattva, Just as your heart desires.”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ལ་བུ་མོ་བློ་གྲོས་བཟང་མོས་ཚིགས་སུ་བཅད་དེ་གསོལ་པ། གང་གིས་སུ་ནི་མཛེས་པར་འགྱུར། །
en: Thereupon the girl Sumati addressed the Bhagavān with these verses: “How does one become beautiful?

source: གང་གིས་ནོར་ནི་ཆེ་བ་དང་། །
en: How does one become wealthy?

source: མི་ཕྱེད་འཁོར་དང་ལྡན་པར་འགྱུར། །
en: How does one come to have a united assembly?

source: ཐུབ་པས་འདི་ནི་བདག་ལ་གསུངས། །
en: Would the Sage teach me this?

source: ཆོས་ཀྱི་རྒྱལ་པོའི་སྤྱན་སྔར་ནི། །གང་གིས་རྫུས་ཏེ་སྐྱེ་འགྱུར་ཞིང་། །འདབ་མ་སྟོང་ལྡན་པདྨ་ལ། །
en: “How does one become spontaneously reborn In the presence of the King of Dharma, Where one comes into being sitting upon A thousand-petaled lotus?

source: མཆིས་པར་ཡང་ནི་གདའ་བ་དང་། །ཞིང་རྣམས་བྱེ་བ་དཔག་ཡས་པར། །སངས་རྒྱས་ཕྱག་བགྱིར་མཆི་བ་ཡི། །རྫུ་འཕྲུལ་ཕ་རོལ་ཕྱིན་འགྱུར་བའི། །སྤྱོད་པ་རྒྱལ་བས་ལུང་བསྟན་གསོལ། །
en: “Would the Victor teach the practices by which One comes to possess the perfections and superhuman powers, And by which one goes to myriad realms without measure In order to pay homage to the buddhas?

source: དགྲ་ཟླ་མ་མཆིས་གང་གིས་འགྱུར། །
en: “What makes one free from enemies?

source: ཚིག་ཀྱང་བཙུན་པར་འགྱུར་བ་དང་། །
en: What gives weight to one’s words?

source: ལས་ཀྱི་སྒྲིབ་པ་མ་མཆིས་དང་། །བདུད་ཀྱི་ལས་ཀུན་མ་མཆིས་དང་། །
en: How can one face no hindrance from karma, And encounter none of Māra’s work?

source: འཆི་བའི་དུས་ནི་བགྱིད་པ་ན། །མངོན་སུམ་སངས་རྒྱས་མཐོང་བ་དང་། །དེ་ལས་ཆོས་ཀྱང་ཉན་པ་དང་། །སྡུག་བསྔལ་ཚོར་བ་མྱོང་མི་འགྱུར། །
en: “When the time of death has come, How can one see the Buddha directly, And also hear the Dharma from him, And not experience the feeling of suffering?”

source: དེ་སྐད་ཅེས་གསོལ་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་བུ་མོ་བློ་གྲོས་བཟང་མོ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །བུ་མོ་ཁྱོད་ཀྱིས་དེ་བཞིན་གཤེགས་པ་ལ་དོན་འདི་དྲི་བར་སེམས་པ་ལེགས་སོ་ལེགས་སོ། །
en: When she had said this, the Bhagavān replied to the girl Sumati, “Girl, your intention to ask the Tathāgata about this topic is excellent!

source: བུ་མོ་དེའི་ཕྱིར་ལེགས་པར་རབ་ཏུ་ཉོན་ལ་ཡིད་ལ་ཟུང་ཤིག་དང་ངས་བཤད་དོ། །
en: It is excellent! Therefore, girl, listen carefully and pay close attention, and I will explain it to you.”

source: བུ་མོ་བློ་གྲོས་བཟང་མོས་བཅོམ་ལྡན་འདས་ལེགས་སོ་ཞེས་གསོལ་ཏེ།
en: The girl Sumati replied, “Excellent, Bhagavān!”

source: བཅོམ་ལྡན་འདས་ཀྱི་ལྟར་ཉན་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་དེ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །བུ་མོ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བཞི་དང་ལྡན་ན་མཛེས་པར་འགྱུར་ཏེ།
en: and she listened accordingly as the Bhagavān taught her: “Girl, there are four dharmas, the possession of which causes a bodhisattva to become beautiful.

source: བཞི་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: What are these four?

source: ཐ་ན་དགྲ་ལ་ཡང་ཁྲོ་བར་མི་བྱེད་པ་དང་། བྱམས་པ་ལ་གནས་པ་དང་། ཆོས་འདོད་པ་དང་། དེ་བཞིན་གཤེགས་པའི་སྐུ་གཟུགས་བྱེད་དུ་འཇུག་པ་སྟེ།
en: They are (1) one does not act out of anger, even at an enemy; (2) one becomes established in love; (3) one desires the Dharma, and (4) one causes figures to be made of the tathāgatas.

source: བུ་མོ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བཞི་པོ་དེ་དག་དང་ལྡན་ན་མཛེས་པར་འགྱུར་རོ། །དེ་ལ་འདི་སྐད་ཅེས་བྱ་སྟེ།
en: Girl, these are the four dharmas the possession of which causes a bodhisattva to become beautiful.

source: གནོད་པའི་རྩ་བ་ཁྲོ་བ་འཕེལ་མི་བྱེད། །བྱམས་ལ་གནས་པར་བྱེད་དང་ཆོས་འདོད་དང་། །དེ་བཞིན་གཤེགས་པའི་སྐུ་གཟུགས་བྱས་ན་ནི། །མཛེས་པར་འགྱུར་ཏེ་བལྟ་བར་འོས་པ་ཡིན། །
en: “About this, it can also be said: “If one does not allow anger, the root of harm, to grow, Dwells in loving kindness, desires the Dharma, And has figures made of the tathāgatas, One becomes beautiful, worthy to behold.

source: བུ་མོ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བཞི་དང་ལྡན་ན་ནོར་ཆེ་བར་འགྱུར་ཏེ།
en: “Girl, there are four dharmas the possession of which causes a bodhisattva to become very wealthy.

source: བཞི་གང་ཞེ་ན།
en: What are these four?

source: འདི་ལྟ་སྟེ། དུས་སུ་སྦྱིན་པ་དང་། འགྱོད་པ་མེད་པར་སྦྱིན་པ་དང་། ཡིད་དུ་འོང་བ་སྦྱིན་པ་དང་། རྣམ་པར་སྨིན་པ་མི་རེ་བར་སྦྱིན་པ་སྟེ།
en: They are (1) giving at the right time, (2) giving without regret, (3) giving with joy, and (4) giving without expecting a result.

source: བུ་མོ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བཞི་པོ་དེ་དག་དང་ལྡན་ན་ནོར་ཆེ་བར་འགྱུར་རོ། །དེ་ལ་འདི་སྐད་ཅེས་བྱ་སྟེ།
en: Girl, these are the four dharmas the possession of which causes a bodhisattva to become very wealthy.

source: དུས་སུ་བྱིན་དང་འགྱོད་པ་མེད་པ་དང་། ཡིད་འོང་སྦྱིན་དང་རྣམ་སྨིན་མི་རེ་བ། །དཔའ་བོ་རྣམས་ནི་ལས་འདི་བྱས་པས་ན། །རྟག་ཏུ་ལོངས་སྤྱོད་ཆེན་པོ་ཐོབ་པ་ཡིན། །
en: “About this, it can also be said: “Giving at the right time, without regret, Giving joyfully and without expecting a result— When heroic ones perform such actions, They will always obtain great wealth.

source: བུ་མོ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བཞི་དང་ལྡན་ན་འཁོར་མི་ཕྱེད་པར་འགྱུར་ཏེ།
en: “Girl, there are four dharmas the possession of which causes a bodhisattva to have a united assembly.

source: ཕྲ་མའི་ཚིག་སྤངས་པ་དང་། སེམས་ཅན་ལོག་པར་ལྟ་བ་རྣམས་ཡང་དག་པའི་ལྟ་བ་ཡང་དག་པར་འཛིན་དུ་འཇུག་ཅིང་འཇོག་པར་བྱེད་པ་དང་། དམ་པའི་ཆོས་འཇིག་པའི་ཚེ་དམ་པའི་ཆོས་སྲུང་བ་དང་། སེམས་ཅན་རྣམས་སངས་རྒྱས་ཀྱི་བྱང་ཆུབ་ཡང་དག་པར་འཛིན་དུ་འཇུག་ཅིང་འཇོག་པར་བྱེད་པ་སྟེ།
en: They are (1) one abstains from divisive speech; (2) one causes beings with mistaken views to grasp the correct view properly and maintain it; (3) one preserves the true Dharma at the time of the destruction of the true Dharma; and (4) one causes beings to grasp properly and maintain the awakening of the buddhas.

source: བུ་མོ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བཞི་པོ་དེ་དག་དང་ལྡན་ན་འཁོར་མི་ཕྱེད་པར་འགྱུར་རོ། །དེ་ལ་འདི་སྐད་ཅེས་བྱ་སྟེ།
en: Girl, these are the four dharmas the possession of which causes a bodhisattva to have a united assembly.

source: ཕྲ་མ་དེ་བཞིན་ལོག་པར་ལྟ་བ་སྤོང་། །དམ་ཆོས་འཇིག་པའི་ཚེ་ན་སྲུང་བ་བྱེད། །སེམས་ཅན་བྱང་ཆུབ་ཡང་དག་འཛིན་འཇུག་ན། །འཁོར་རྣམས་མི་ཕྱེད་ཕུན་སུམ་ཚོགས་པར་འགྱུར། །
en: “About this, it can also be said: “If one abstains from divisive speech and wrong views, One preserves the Dharma at the time of its destruction, And one causes beings to grasp awakening properly, One’s assembly will be united, and it will thrive.

source: བུ་མོ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བཞི་དང་ལྡན་ན། སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་ཐད་དུ་རིན་པོ་ཆེ་ཆེན་པོའི་པདྨ་ལས་རྫུས་ཏེ་སྐྱེ་བར་འགྱུར་ཏེ།
en: “Girl, there are four dharmas the possession of which causes a bodhisattva to be reborn spontaneously from a lotus of precious substances in the presence of the buddhas, the bhagavāns.

source: བཞི་གང་ཞེ་ན། འདི་ལྟ་སྟེ། ཕྱེ་མ་འམ། མེ་ཏོག་ཨུད་པ་ལ་འམ། པདྨ་འམ། ཀུ་མུ་དའམ།
en: What are these four?

source: པདྨ་དཀར་པོས་ལག་པ་བཀང་སྟེ། དེ་བཞིན་གཤེགས་པའི་སྐུ་གཟུགས་སམ། དེ་བཞིན་གཤེགས་པའི་མཆོད་རྟེན་ལ་འབུལ་བ་དང་། གཞན་དག་ལ་ཡང་གནོད་སེམས་མི་སྐྱེད་པ་དང་། དེ་བཞིན་གཤེགས་པའི་སྐུ་གཟུགས་པདྨའི་གདན་ལ་བཞུགས་པ་བྱེད་དུ་འཇུག་པ་དང་།
en: They are (1) offering handfuls of powders, blue lotus flowers, red lotuses, white water lilies, and white lotuses to a figure of the Tathāgata or a stūpa of the Tathāgata; (2) not giving rise to harmful thoughts toward others; (3) causing figures to be made of the Tathāgata seated on a lotus; and (4) having strong faith in the certainty of the awakening of the Buddha.

source: སངས་རྒྱས་ཀྱི་བྱང་ཆུབ་ལ་ངེས་པ་རྒྱ་ཆེར་མོས་པ་སྟེ། བུ་མོ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བཞི་པོ་དེ་དག་དང་ལྡན་ན་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་ཐད་དུ་རིན་པོ་ཆེ་ཆེན་པོའི་པདྨ་ལས་རྫུས་ཏེ་སྐྱེ་བར་འགྱུར་རོ། །དེ་ལ་འདི་སྐད་ཅེས་བྱ་སྟེ།
en: Girl, these are the four dharmas the possession of which causes a bodhisattva to be reborn spontaneously from a lotus of precious substances in the presence of the buddhas, the bhagavāns.

source: ཕྱེ་མ་མེ་ཏོག་བཀང་སྟེ་འབུལ་བ་དང་། །གནོད་སེམས་སྤོང་ཞིང་སྐུ་གཟུགས་བྱེད་པ་དང་། །མོས་པ་རྒྱ་ཆེན་ལ་ནི་གནས་བྱེད་ན། །རྒྱལ་བ་དག་གི་ཐད་དུ་རྫུས་ཏེ་སྐྱེ། །
en: “About this, it can also be said: “One who offers handfuls of powders and flowers, Abstains from thoughts of harm, makes figures, And is established in strong faith Is reborn spontaneously in the presence of the victors.

source: བུ་མོ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བཞི་དང་ལྡན་ན་རྫུ་འཕྲུལ་གྱིས་སངས་རྒྱས་ཀྱི་ཞིང་ནས་སངས་རྒྱས་ཀྱི་ཞིང་དུ་འགྲོ་བར་འགྱུར་ཏེ།
en: “Girl, there are four dharmas the possession of which enables a bodhisattva to go by means of superhuman powers from one buddha realm to another buddha realm.

source: གཞན་དག་གི་དགེ་བའི་རྩ་བའི་བར་ཆད་མི་བྱེད་པ་དང་། གཞན་དག་ཆོས་ཉན་པ་ལ་བར་ཆད་མི་བྱེད་པ་དང་། དེ་བཞིན་གཤེགས་པའི་མཆོད་རྟེན་དག་ལ་མར་མེ་འབུལ་བ་དང་། ཏིང་ངེ་འཛིན་སྒོམ་པ་སྟེ།
en: They are (1) not interfering with others’ roots of virtue, (2) not interfering as others hear the Dharma, (3) offering butter lamps to the stūpas of the Tathāgata, and (4) cultivating meditative concentration.

source: བུ་མོ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བཞི་པོ་དེ་དག་དང་ལྡན་ན་རྫུ་འཕྲུལ་གྱིས་སངས་རྒྱས་ཀྱི་ཞིང་ནས་སངས་རྒྱས་ཀྱི་ཞིང་དུ་འགྲོ་བར་འགྱུར་རོ། །དེ་ལ་འདི་སྐད་ཅེས་བྱ་སྟེ།
en: Girl, these are the four dharmas the possession of which enables a bodhisattva to go by means of superhuman powers from one buddha realm to another buddha realm.

source: དགེ་བ་དག་གི་བར་ཆད་མི་བྱེད་དང་། །གཞན་གྱི་ཆོས་གཏམ་དག་ལ་མི་སྨོད་དང་། །རྒྱལ་བའི་མཆོད་རྟེན་དག་ལ་མར་མེ་འབུལ། །ཏིང་འཛིན་བསྒོམས་པས་དེ་ནི་ཞིང་དུ་འགྲོ། །
en: “About this, it can also be said: “Those who do not interfere with virtue, Do not criticize the Dharma teachings of others, Do offer butter lamps to stūpas of the Tathāgata, And cultivate meditative concentration will go to buddha realms.

source: བུ་མོ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བཞི་དང་ལྡན་ན་དགྲ་ཟླ་མེད་པར་འགྱུར་ཏེ།
en: “Girl, there are four dharmas the possession of which makes a bodhisattva free from enemies.

source: གཡོ་མེད་པར་དགེ་བའི་བཤེས་གཉེན་དག་ལ་སྟེན་པ་དང་། དགེ་བའི་རྩ་བ་ལ་སེར་སྣ་མི་བྱེད་པ་དང་། གཞན་གྱི་རྙེད་པ་ལ་དགའ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་བྱ་བ་དང་གནས་པ་ཐམས་ཅད་ལ་ཁོང་ཁྲོ་བར་མི་བྱེད་ཅིང་མི་སྙན་པ་མི་སྒྲོགས་པ་སྟེ།
en: They are (1) one relies upon spiritual friends without any deceit, (2) one does not covet roots of virtue, (3) one feels joy in others’ gains, and (4) one does not give rise to anger or spread criticism about any of the states or deeds of bodhisattvas.

source: བུ་མོ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བཞི་པོ་དེ་དག་དང་ལྡན་ན་དགྲ་ཟླ་མེད་པར་འགྱུར་རོ། །
en: Girl, these are the four dharmas the possession of which makes a bodhisattva free from enemies.

source: དེ་ལ་འདི་སྐད་ཅེས་བྱ་སྟེ། དགེ་བའི་བཤེས་གཉེན་རྣམས་ལ་དེ་གཡོ་མེད། །གཞན་གྱི་རྙེད་ལ་དགའ་ཞིང་སེར་སྣ་མེད། །བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་ལ་མི་སྨོད་ན། །རྟག་ཏུ་དགྲ་ཟླ་མེད་པར་སྤྱོད་པར་འགྱུར། །
en: “About this, it can also be said: “Having no deceit toward spiritual friends, Feeling joy and not envy toward others’ gains, And not criticizing the conduct of bodhisattvas, One will always be without enemies.

source: བུ་མོ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བཞི་དང་ལྡན་ན་ཚིག་བཙུན་པར་འགྱུར་ཏེ།
en: “Girl, there are four dharmas the possession of which gives weight to a bodhisattva’s words.

source: ཇི་སྐད་སྨྲས་པ་དེ་བཞིན་བྱེད་པ་དང་མཛའ་བོ་དག་ལ་ཡོད་པའི་རང་བཞིན་མི་འཆབ་པ་དང་། ཀླན་ཀ་མི་ཚོལ་བར་ཆོས་ཉན་པ་དང་། གཞན་ཆོས་སྨྲ་བ་དག་ལ་དཔྱ་སྐུར་མི་བྱེད་པ་སྟེ།
en: They are (1) doing what one says one will do, (2) not hiding one’s nature from friends, (3) listening to teachings without looking for faults, and (4) not slandering other teachers of the Dharma.

source: བུ་མོ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བཞི་པོ་དེ་དག་དང་ལྡན་ན་ཚིག་བཙུན་པར་འགྱུར་རོ། །
en: Girl, these are the four dharmas the possession of which gives weight to a bodhisattva’s words.

source: དེ་ལ་འདི་སྐད་ཅེས་བྱ་སྟེ། ཇི་སྐད་སྨྲས་པ་དེ་བཞིན་བྱེད་པ་དང་། །མཛའ་ལ་ཡོད་པའི་རང་བཞིན་མི་འཆབ་ཅིང་། །ཀླན་ཀ་མི་ཚོལ་ཆོས་ནི་ཉན་བྱེད་ན། །འཇིགས་པ་མེད་ཅིང་ཚིག་ཀྱང་བཙུན་པར་འགྱུར། །
en: “About this, it can also be said: “If one does what one says one will do, Does not hide one’s nature from friends, And listens to teachings without looking for faults, One will have no fear and also one’s words will have weight.

source: བུ་མོ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བཞི་དང་ལྡན་ན་ལས་ཀྱི་སྒྲིབ་པ་མེད་པར་འགྱུར་ཞིང་། །ཡོངས་སུ་དག་པ་ཡང་མྱུར་དུ་རྟོགས་པར་འགྱུར་ཏེ།
en: “Girl, there are four dharmas the possession of which causes a bodhisattva to face no hindrance from karma and also quickly realize purity.

source: ལྷག་པའི་བསམ་པ་བསྒྲུབས་པས་སྡོམ་པ་གསུམ་ཡང་དག་པར་ལེན་པ་དང་། མདོ་སྡེ་ཟབ་མོ་རྣམས་མི་སྤོང་བ་དང་། སེམས་དང་པོ་བསྐྱེད་པའི་བྱང་ཆུབ་སེམས་དཔའ་ལ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་འདུ་ཤེས་སྐྱེད་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ལ་བྱམས་པ་སྒོམ་པ་སྟེ།
en: They are (1) one fully takes up the three vows with the establishment of one’s ambition, (2) one does not disdain the profound sūtras, (3) one considers a bodhisattva who has conceived the aspiration for awakening for the first time to be none other than the Omniscient One, and (4) one cultivates love for all beings.

source: བུ་མོ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བཞི་པོ་དེ་དག་དང་ལྡན་ན་ལས་ཀྱི་སྒྲིབ་པ་མེད་པར་འགྱུར་ཞིང་ཡོངས་སུ་དག་པ་ཡང་མྱུར་དུ་རྟོགས་པར་འགྱུར་རོ། །དེ་ལ་འདི་སྐད་ཅེས་བྱ་སྟེ།
en: Girl, these are the four dharmas the possession of which causes a bodhisattva to face no hindrance from karma and also quickly realize purity.

source: ལྷག་པའི་བསམ་པས་སྡོམ་པ་གསུམ་ལ་གནས། །མདོ་སྡེ་ཟབ་མོ་རྣམས་ལ་རྟག་ཏུ་མོས། །སངས་རྒྱས་སྲས་ལ་ཐམས་ཅད་མཁྱེན་ལྟར་ལྟ། །སེམས་ཅན་རྣམས་ལ་བྱམས་པས་ལས་དག་འགྱུར། །
en: “About this, it can also be said: “Abiding by the three vows with ambition, Always being interested in the profound sūtras, Seeing the Buddha’s progeny as the Omniscient One, And having love for beings, one’s karma becomes pure.

source: བུ་མོ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བཞི་དང་ལྡན་ན་བདུད་ཀྱི་ལས་མེད་པར་འགྱུར་ཏེ།
en: “Girl, there are four dharmas the possession of which causes a bodhisattva to encounter none of Māra’s work.

source: ཆོས་ཐམས་ཅད་མཉམ་པ་ཉིད་དུ་སྒོམ་པ་དང་། བརྩོན་འགྲུས་བརྩམས་པ་དང་། སངས་རྒྱས་རྗེས་སུ་དྲན་པ་སྒོམ་པ་དང་། དགེ་བའི་རྩ་བ་ཡོངས་སུ་སྔོ་བ་སྟེ།
en: They are (1) meditating on the sameness of all things, (2) undertaking heroic effort, (3) meditating on the recollection of the Buddha, and (4) dedicating the roots of virtue.

source: བུ་མོ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བཞི་པོ་དེ་དག་དང་ལྡན་ན་བདུད་ཀྱི་ལས་མེད་པར་འགྱུར་རོ། །
en: Girl, these are the four dharmas the possession of which causes a bodhisattva to encounter none of Māra’s work.

source: དེ་ལ་འདི་སྐད་ཅེས་བྱ་སྟེ། ཆོས་རྣམས་ལ་ནི་ཆོས་ཀྱི་ཚུལ་རྟོགས་ལ། །བརྩོན་འགྲུས་བརྩམས་ཤིང་སངས་རྒྱས་རྗེས་སུ་དྲན། །ཡོངས་སུ་སྔོ་ཞིང་བཤགས་དང་ཕྱག་འཚལ་བ། །དེ་ལ་བདུད་ཀྱིས་གླགས་ནི་རྙེད་མི་འགྱུར། །
en: “About this, it can also be said: “One who realizes the principle of dharma toward all things, Undertakes heroic effort, recollects the Buddha, And makes dedication, confession, and veneration— Māra will not find any opportunity to harm such a person.

source: བུ་མོ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བཞི་དང་ལྡན་ན་འཆི་བའི་དུས་ཀྱི་ཚེ་མདུན་དུ་སངས་རྒྱས་བཞུགས་ཤིང་དེ་ལས་ཆོས་ཀྱང་ཉན་ལ་སྡུག་བསྔལ་ཡང་མྱོང་བར་མི་འགྱུར་ཏེ།
en: “Girl, there are four dharmas a bodhisattva’s possession of which causes the Buddha to appear in the presence of that bodhisattva at the time of death and, at that time, to hear the Dharma from him, and also not to experience any suffering.

source: འདི་ལྟ་སྟེ། གཞན་དག་གི་བསམ་པ་ཡོངས་སུ་རྫོགས་པར་བྱེད་པ་དང་། མོས་པ་མང་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་སྦྱིན་པ་བཀོད་པ་སྣ་ཚོགས་ཉེ་བར་སྒྲུབ་པ་དང་། དཀོན་མཆོག་གསུམ་མཆོད་པ་ལ་བརྩོན་པ་སྟེ།
en: They are (1) fulfilling the wishes of others, (2) having great devotion, (3) gathering together a diverse array of the generosity of a bodhisattva, and (4) endeavoring to make offerings to the Three Jewels.

source: བུ་མོ་བྱང་ཆུབ་སེམས་དཔའ་ཆོས་བཞི་པོ་དེ་དག་དང་ལྡན་ན་འཆི་བའི་དུས་ཀྱི་ཚེ་མདུན་དུ་སངས་རྒྱས་བཞུགས་ཤིང་དེ་ལས་ཆོས་ཀྱང་ཉན་ལ་སྡུག་བསྔལ་ཡང་མྱོང་བར་མི་འགྱུར་རོ། །དེ་ལ་འདི་སྐད་ཅེས་བྱ་སྟེ།
en: Girl, these are the four dharmas a bodhisattva’s possession of which causes the Buddha to appear in the presence of that bodhisattva at the time of death and, at that time, to hear the Dharma from him, and also not to experience any suffering.

source: དེ་ནི་གཞན་གྱི་བསམ་པ་རྫོགས་བྱེད་ཅིང་། །མོས་པ་དང་ནི་སྦྱིན་པ་རྒྱ་ཆེ་བ། །མཁས་པ་དེ་ནི་རྟག་ཏུ་སྦྱིན་པར་བྱེད། །དེ་ཕྱིར་དེ་མདུན་དེ་བཞིན་གཤེགས་པ་བཞུགས། །
en: “About this, it can also be said: “Those who fulfill the wishes of others, Have devotion and great generosity, And always make offerings to the wise— The Tathāgata appears to such people as a result.”

source: དེ་སྐད་ཅེས་བཀའ་སྩལ་ནས་བཅོམ་ལྡན་འདས་ལ་བུ་མོ་བློ་གྲོས་བཟང་མོས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཙུན་པ་བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའི་བསླབ་པ་ཇི་སྐད་བཅས་པ་འདི་དག་ལ་བདག་གིས་བསླབ་པར་འཚལ་ཏེ།
en: After the Bhagavān had spoken thus, the girl Sumati said this to him: “Venerable Bhagavān, I want to train in the precepts of a bodhisattva exactly as you have taught them.

source: བཅོམ་ལྡན་འདས་གལ་ཏེ་བདག་གིས་བཞི་པ་བཅུ་པོ་ཇི་སྐད་དུ་བཀའ་སྩལ་པ་འདི་དག་ལས་ཆོས་གཅིག་ཅིག་མ་སྤྱད་ན་ཡང་བདག་གིས་དེ་བཞིན་གཤེགས་པའི་སྐུ་བསླུས་པར་གྱུར་ཅིག །
en: Should I fail to practice even a single dharma from among these ten sets of four, exactly as you have taught them, Bhagavān, then I would be deceiving the figure of the Tathāgata.”

source: དེ་ནས་གནས་བརྟན་མཽད་གལ་གྱི་བུ་ཆེན་པོས་བུ་མོ་བློ་གྲོས་བཟང་མོ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །བུ་མོ་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སྤྱོད་པ་ནི་ཉམས་འོག་ཏུ་ཆུད་པར་དཀའ་ན་ཁྱོད་འདི་ལྟ་བུ་ཡང་དག་པར་ལེན་པར་བྱེད་ན། །ཅི་ཁྱོད་ཀྱིས་སེམས་ལ་དབང་ཐོབ་བམ། །
en: The elder, the great Maudgalyāyana, then spoke to the girl Sumati in this way: “Girl, given that the conduct of the bodhisattvas is difficult to comprehend, have you attained mastery over your mind when you take it upon yourself to act fully in this way?”

source: དེ་སྐད་ཅེས་སྨྲས་ནས་བུ་མོ་བློ་གྲོས་བཟང་མོས་ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུ་ཆེན་པོ་ལ། འདི་སྐད་ཅེས་སྨྲས་སོ། །བཙུན་པ་མཽད་གལ་གྱི་བུ་བདེན་པ་དང་བདེན་པའི་ཚིག་གང་གིས་བདག་གིས་ཆོས་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་བྱེད་པར་འགྱུར་བའི་བདེན་པ་དང་བདེན་པའི་ཚིག་དེས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་རྣམ་པ་དྲུག་ཏུ་གཡོས་ཏེ་ལྷའི་མེ་ཏོག་གི་ཆར་འབབ་པར་གྱུར་ཅིག །མ་དཀྲོལ་བར་ཡང་སིལ་སྙན་གྱི་སྒྲ་འབྱུང་བར་གྱུར་ཅིག་ཅེས་བྱས་སོ། །
en: The girl Sumati replied to the venerable one, the great Maudgalyāyana, “By the truth and by these words of truth, Venerable Maudgalyāyana, that is, by the truth and the words of truth that I will realize all these dharmas, may this cosmos of a billion worlds shake in six different ways, may there be a shower of heavenly flowers, and may the sound of musical instruments spontaneously arise!”

source: དེ་ནས་བུ་མོ་བློ་གྲོས་བཟང་མོས་དེ་ལྟར་བདེན་པའི་བྱིན་བརླབས་བྱས་མ་ཐག་ཏུ་དེའི་མོད་ལ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་རྣམ་པ་དྲུག་ཏུ་གཡོས་ཏེ། ལྷའི་མེ་ཏོག་གི་ཆར་བབ་པར་གྱུར་ཅིང་། མ་དཀྲོལ་བར་ལྷའི་སིལ་སྙན་གྱི་སྒྲ་ཡང་བྱུང་བར་གྱུར་ཏོ། །
en: Thereafter, as soon as the girl Sumati had made the truthful resolution, at that moment the cosmos of a billion worlds shook in six different ways, a shower of heavenly flowers fell, and the sound of musical instruments spontaneously arose.

source: བཙུན་པ་མཽད་གལ་གྱི་བུ་བདེན་པ་དང་བདེན་པའི་ཚིག་གང་གིས། ད་ལྟར་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཤཱཀྱ་ཐུབ་པ་ཇི་ལྟ་བ་དེ་བཞིན་དུ་མ་འོངས་པའི་དུས་ན་བདག་དེ་བཞིན་གཤེགས་པར་འགྱུར་ཞིང་། སངས་རྒྱས་ཀྱི་ཞིང་དེར་བདག་ལ་བདུད་ཀྱང་འབྱུང་བར་མི་འགྱུར་བ་དང་། ངན་སོང་རྣམས་ཀྱི་མིང་ཡང་མེད་པ་དང་། བུད་མེད་ཀྱི་སྐྱོན་རྣམས་མེད་པར་འགྱུར་བའི་བདེན་པ་དང་བདེན་པའི་ཚིག་དེས།
en: “Venerable Maudgalyāyana,” she said, “by the truth and by these words of truth—that is, by the truth and by these words of truth to the effect that I will become a tathāgata in the future just like the present tathāgata, arhat, perfect and completely awakened Buddha Śākyamuni, and that in that buddha realm, Māra will not appear to me, not even the name of the lower realms of rebirth will arise there, and the faults of women will not exist there—may this assembly become golden in color!”

source: འཁོར་འདི་གསེར་གྱི་ཁ་དོག་ཅན་དུ་གྱུར་ཅིག །བུ་མོ་བློ་གྲོས་བཟང་མོས་ཚིག་དེ་སྐད་ཅེས་སྨྲས་མ་ཐག་ཏུ་དེའི་མོད་ལ་ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་དེ་གསེར་གྱི་ཁ་དོག་ཅན་དུ་གྱུར་ཏོ། །
en: As soon as the girl Sumati uttered these words, at that same moment, the entire assembly became golden in color.

source: དེ་ནས་ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུ་ཆེན་པོ་སྟན་ལས་ལངས་ཏེ་ཆོས་གོས་ཕྲག་པ་གཅིག་ཏུ་བགོས་ནས་པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ཏེ། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བདག་ནི་སེམས་དང་པོ་བསྐྱེད་པ་ནས་བཟུང་སྟེ་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ། །
en: Thereafter, the great Maudgalyāyana, the highly respected one, arose from his seat, draped his upper robe on one shoulder, knelt on his right knee, and with his palms joined together in a gesture of respect, he bowed to the Bhagavān and said this to him, “I bow to all the bodhisattvas, Bhagavān, beginning with those who have conceived the aspiration for awakening for the first time.”

source: དེ་ནས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་བུ་མོ་བློ་གྲོས་བཟང་མོ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །བློ་གྲོས་བཟང་མོ་ཁྱོད་ཆོས་གང་ལ་གནས་ཏེ་བདེན་པའི་བྱིན་གྱི་རླབས་འདི་བྱས།
en: Thereupon, Mañjuśrī Kumārabhūta asked the girl Sumati, “Based upon which dharma, Sumati, did you make this truthful resolution?”

source: བློ་གྲོས་བཟང་མོས་སྨྲས་པ། འཇམ་དཔལ་ཆོས་ཀྱི་དབྱིངས་ནི་གནས་པ་མ་མཆིས་པས་དེ་ལ་གནས་པར་མི་ནུས་ཏེ་འདི་ལ་དྲི་བ་མ་མཆིས་སོ། །
en: “Mañjuśrī,” Sumati replied, “Since the dharmadhātu has no basis, nothing can be based upon it.

source: འཇམ་དཔལ་གྱིས་སྨྲས་པ།
en: Therefore, there is no question about it.”

source: བློ་གྲོས་བཟང་མོ་བྱང་ཆུབ་ཅེས་བྱ་བ་འདི་གང་གི་ཚིག་བླ་དགས་ཡིན།
en: “Sumati, to what does the term awakening refer?”

source: བློ་གྲོས་བཟང་མོས་སྨྲས་པ།
en: Mañjuśrī་ asked.

source: འཇམ་དཔལ་བྱང་ཆུབ་ཅེས་བགྱི་བ་ནི་རྣམ་པར་མི་རྟོག་པའི་ཆོས་ཀྱི་ཚིག་བླ་དགས་སོ། །འཇམ་དཔལ་གྱིས་སྨྲས་པ།
en: “Mañjuśrī,” Sumati replied, “the term awakening refers to a dharma that is not conceptualized.”
